"""
Создайте класс Lion. В нем должен быть метод roar, который печатает на экран "Rrrrrrr!!!"

Пример работы с классом Lion

simba = Lion()
simba.roar() # печатает Rrrrrrr!!!
"""


class Lion:
    @staticmethod
    def roar():
        print("Rrrrrrr!!!")
