"""
Качество кода

Качественный код - это код, который легко читать и легко поддерживать. (readability and supportability)
Легко читать - это значит чтобы код выглядел красиво и внятно, см. Python Zen
Легко поддерживать - это легко исправлять и доделывать.

Чистый код — это код, который просто читать, понимать и поддерживать.
Чистый код улучшает предсказуемость разработки и повышает качество продукта.

Грязный код является не только результатом лени и невежества,
но и побочным продуктом частых изменений в процессе разработки.

Coding Style (обычно PEP8) https://pythonworld.ru/osnovy/pep-8-rukovodstvo-po-napisaniyu-koda-na-python.html

Стандарт оформления кода (стандарт кодирования, стиль программирования)
(англ. coding standards, coding convention или programming style) — набор правил и соглашений,
используемых при написании исходного кода на языке программирования.
Наличие общего стиля программирования облегчает понимание и поддержание исходного кода,
написанного более чем одним программистом, а также упрощает взаимодействие нескольких человек
при разработке программного обеспечения.

Рефакторинг (refactoring) - переписывание рабочего кода, делая код легко читаемым и поддерживаемым.
Это контролируемый процесс улучшения кода, без написания новой функциональности.
Результат рефакторинга — это чистый код и простой дизайн.

Пошаговые изменения, сопровождаемые частыми запусками тестов — это то,
что делает процесс рефакторинга эффективным и безопасным.

Запахи кода — это индикаторы проблем, на которые нужно обращать внимание при рефакторинге.
Часто их легко найти и исправить, но иногда они предвещают о глубинных проблемах с кодом.

Техники рефакторинга описывают конкретные методы борьбы с грязным кодом.
Большинство рефакторингов имеет как достоинства, так и недостатки.
Поэтому любой рефакторинг должен быть мотивирован и обдуман.
"""
