"""
Выведите строку задом наперед

Sample Input:
hello

Sample Output:
olleh
"""


strng = input()
print(strng[::-1])
